Tekla Open API Reference for Tekla Structures 2025
StructuresInstallation Properties
The StructuresInstallation type exposes the following members.
Properties
Name | Description
BinFolder
 Gets Path to Tekla Structures binary (bin) directory.
EnvBaseFolder
 Gets Path to Tekla Structures XSDATADIR directory. XSDATADIR is defined in the teklastructures.ini file. It points to a location, where the installation installs the environment files and folders. Example: C:\ProgramData\Trimble\Tekla Structures\Version
InstallFolder |  Obsolete.
 Gets path to Tekla Structures installation directory.
MessageFolder |  Obsolete.
 Gets path to Tekla Structures messages directory.
MessagesFolder
 Gets a list Paths to Tekla Structures messages directories.
Top
See Also
Reference
StructuresInstallation Class
Tekla.Structures.Dialog Namespace